#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.backend_dev.module.users.aws_cognito_user_pool.user_pool: Refreshing state... [id=us-east-2_VwBSf2Ukk]
module.frontend.aws_wafv2_web_acl.waf_acl: Refreshing state... [id=4e60e6b0-61a3-4a70-9a60-4a252f3e7c7c]
module.backend_dev.module.users.aws_cognito_user_pool_client.client: Refreshing state... [id=7rcpjko4kf8enhvohutgm368nv]
module.frontend.aws_s3_bucket.bucket: Refreshing state... [id=video.rayprogramming.com]
module.frontend.aws_cloudfront_origin_access_identity.oai: Refreshing state... [id=E2KG39NGUA7DI2]
module.frontend.aws_acm_certificate.ssl: Refreshing state... [id=arn:aws:acm:us-east-1:529080338478:certificate/3f355d4e-762e-4305-a1de-b04e42a54abd]
module.frontend.aws_acm_certificate_validation.ssl: Refreshing state... [id=2022-01-23 21:54:35.297 +0000 UTC]
module.frontend.aws_s3_bucket_acl.bucket_acl: Refreshing state... [id=video.rayprogramming.com,private]
module.frontend.aws_s3_bucket_public_access_block.bucket_pab: Refreshing state... [id=video.rayprogramming.com]
module.frontend.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=video.rayprogramming.com]
module.frontend.aws_s3_bucket_versioning.bucket_version: Refreshing state... [id=video.rayprogramming.com]
module.frontend.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E2QZVOHCSCH69J]
module.frontend.aws_route53_record.subdomain_root: Refreshing state... [id=Z0504674431EVA0LRLBF_video.rayprogramming.com_A]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.backend_dev.module.users.aws_cognito_user_pool.user_pool has changed
  ~ resource "aws_cognito_user_pool" "user_pool" {
      + custom_domain             = "user.video.rayprogramming.com"
      + domain                    = "user.video.rayprogramming.com"
      ~ estimated_number_of_users = 0 -> 2
        id                        = "us-east-2_VwBSf2Ukk"
      ~ last_modified_date        = "2022-03-04T05:43:44Z" -> "2022-04-18T01:58:12Z"
        name                      = "videoStreamer-dev"
        tags                      = {}
        # (6 unchanged attributes hidden)

      ~ admin_create_user_config {
          ~ allow_admin_create_user_only = true -> false
        }



        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.frontend.aws_acm_certificate.ssl will be updated in-place
  ~ resource "aws_acm_certificate" "ssl" {
        id                        = "arn:aws:acm:us-east-1:529080338478:certificate/3f355d4e-762e-4305-a1de-b04e42a54abd"
      ~ tags                      = {
          ~ "site" = "rayprogramming.com" -> "video.rayprogramming.com"
        }
      ~ tags_all                  = {
          ~ "site" = "rayprogramming.com" -> "video.rayprogramming.com"
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.frontend.aws_route53_record.ssl_verification["video.rayprogramming.com"] will be created
  + resource "aws_route53_record" "ssl_verification" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_03818f016c5687757483524eb672ebaa.video.rayprogramming.com"
      + records         = [
          + "_1abd35832b04e0474f50ac21a9ef59ab.pczglchxlc.acm-validations.aws.",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z0504674431EVA0LRLBF"
    }

  # module.frontend.aws_route53_record.ssl_verification["www.video.rayprogramming.com"] will be created
  + resource "aws_route53_record" "ssl_verification" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_cb0ab2c26d165a5dbd01aee00ae73bee.www.video.rayprogramming.com"
      + records         = [
          + "_095e40aecd67de3916177ce631b592c8.pczglchxlc.acm-validations.aws.",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z0504674431EVA0LRLBF"
    }

  # module.frontend.aws_route53_record.subdomain_www will be created
  + resource "aws_route53_record" "subdomain_www" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.video.rayprogramming.com"
      + type            = "A"
      + zone_id         = "Z0504674431EVA0LRLBF"

      + alias {
          + evaluate_target_health = false
          + name                   = "d3wdzbv6aatdr.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # module.backend_dev.module.users.aws_acm_certificate.ssl will be created
  + resource "aws_acm_certificate" "ssl" {
      + arn                       = (known after apply)
      + domain_name               = "auth.video.rayprogramming.com"
      + domain_validation_options = [
          + {
              + domain_name           = "auth.video.rayprogramming.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags_all                  = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.backend_dev.module.users.aws_acm_certificate.user_ssl will be created
  + resource "aws_acm_certificate" "user_ssl" {
      + arn                       = (known after apply)
      + domain_name               = "users.video.rayprogramming.com"
      + domain_validation_options = [
          + {
              + domain_name           = "users.video.rayprogramming.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags_all                  = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.backend_dev.module.users.aws_apigatewayv2_api.api will be created
  + resource "aws_apigatewayv2_api" "api" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "videoStreamer-users-dev"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)
    }

  # module.backend_dev.module.users.aws_apigatewayv2_domain_name.domain will be created
  + resource "aws_apigatewayv2_domain_name" "domain" {
      + api_mapping_selection_expression = (known after apply)
      + arn                              = (known after apply)
      + domain_name                      = "users.video.rayprogramming.com"
      + id                               = (known after apply)
      + tags_all                         = (known after apply)

      + domain_name_configuration {
          + certificate_arn                        = (known after apply)
          + endpoint_type                          = "REGIONAL"
          + hosted_zone_id                         = (known after apply)
          + ownership_verification_certificate_arn = (known after apply)
          + security_policy                        = "TLS_1_2"
          + target_domain_name                     = (known after apply)
        }
    }

  # module.backend_dev.module.users.aws_apigatewayv2_integration.register will be created
  + resource "aws_apigatewayv2_integration" "register" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + description                               = "Lambda example"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.backend_dev.module.users.aws_apigatewayv2_route.register will be created
  + resource "aws_apigatewayv2_route" "register" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /register"
      + target             = (known after apply)
    }

  # module.backend_dev.module.users.aws_apigatewayv2_stage.stage will be created
  + resource "aws_apigatewayv2_stage" "stage" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = false
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "dev"
      + tags_all      = (known after apply)
    }

  # module.backend_dev.module.users.aws_cognito_user_pool.user_pool will be updated in-place
  ~ resource "aws_cognito_user_pool" "user_pool" {
        id                        = "us-east-2_VwBSf2Ukk"
        name                      = "videoStreamer-dev"
        tags                      = {}
        # (10 unchanged attributes hidden)

      ~ admin_create_user_config {
          ~ allow_admin_create_user_only = false -> true
        }



        # (3 unchanged blocks hidden)
    }

  # module.backend_dev.module.users.aws_cognito_user_pool_client.client will be updated in-place
  ~ resource "aws_cognito_user_pool_client" "client" {
        id                                   = "7rcpjko4kf8enhvohutgm368nv"
      ~ name                                 = "video_auth" -> "videoStreamer_auth"
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.backend_dev.module.users.aws_cognito_user_pool_domain.users will be created
  + resource "aws_cognito_user_pool_domain" "users" {
      + aws_account_id              = (known after apply)
      + certificate_arn             = (known after apply)
      + cloudfront_distribution_arn = (known after apply)
      + domain                      = "auth.video.rayprogramming.com"
      + id                          = (known after apply)
      + s3_bucket                   = (known after apply)
      + user_pool_id                = "us-east-2_VwBSf2Ukk"
      + version                     = (known after apply)
    }

  # module.backend_dev.module.users.aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "iam_for_lambda"
      + name_prefix           = (known after apply)
      + path                  = "/videoStreamer/dev/users/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.backend_dev.module.users.aws_lambda_function.confirm_register will be created
  + resource "aws_lambda_function" "confirm_register" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "backend/users/users_confirmRegister.zip"
      + function_name                  = "users_confirm_register"
      + handler                        = "confirm_register.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "04aZpEEAIBFWGU3bCZsYE8XbZtsNYaZuPuFT6Jdf/nM="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CLIENT_ID"     = "7rcpjko4kf8enhvohutgm368nv"
              + "CLIENT_SECRET" = (sensitive)
              + "POOL_ID"       = "us-east-2_VwBSf2Ukk"
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.backend_dev.module.users.aws_lambda_function.register will be created
  + resource "aws_lambda_function" "register" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "backend/users/users_register.zip"
      + function_name                  = "users_register"
      + handler                        = "register.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "NKbtwJNGLfnVEQtNdnLS6Ia7kHtr0IwQ8AZun+nCaSU="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CLIENT_ID"     = "7rcpjko4kf8enhvohutgm368nv"
              + "CLIENT_SECRET" = (sensitive)
              + "POOL_ID"       = "us-east-2_VwBSf2Ukk"
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.backend_dev.module.users.aws_route53_record.api_subdomain will be created
  + resource "aws_route53_record" "api_subdomain" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "users.video.rayprogramming.com"
      + type            = "A"
      + zone_id         = "Z0504674431EVA0LRLBF"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.backend_dev.module.users.aws_route53_record.auth_ssl_verification["auth.video.rayprogramming.com"] will be created
  + resource "aws_route53_record" "auth_ssl_verification" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 300
      + type            = (known after apply)
      + zone_id         = "Z0504674431EVA0LRLBF"
    }

  # module.backend_dev.module.users.aws_route53_record.user_ssl_verification["users.video.rayprogramming.com"] will be created
  + resource "aws_route53_record" "user_ssl_verification" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 300
      + type            = (known after apply)
      + zone_id         = "Z0504674431EVA0LRLBF"
    }

  # module.backend_dev.module.users.aws_ssm_parameter.users_client_id will be created
  + resource "aws_ssm_parameter" "users_client_id" {
      + arn         = (known after apply)
      + data_type   = (known after apply)
      + description = "Cognito Client Id for managing users"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "/videoStreamer/dev/users/client_id"
      + tags_all    = (known after apply)
      + tier        = "Standard"
      + type        = "String"
      + value       = (sensitive value)
      + version     = (known after apply)
    }

  # module.backend_dev.module.users.aws_ssm_parameter.users_client_secret will be created
  + resource "aws_ssm_parameter" "users_client_secret" {
      + arn         = (known after apply)
      + data_type   = (known after apply)
      + description = "Cognito Client Secret for managing users"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "/videoStreamer/dev/users/client_secret"
      + tags_all    = (known after apply)
      + tier        = "Standard"
      + type        = "SecureString"
      + value       = (sensitive value)
      + version     = (known after apply)
    }

  # module.backend_dev.module.users.aws_ssm_parameter.users_pool_id will be created
  + resource "aws_ssm_parameter" "users_pool_id" {
      + arn         = (known after apply)
      + data_type   = (known after apply)
      + description = "Cognito Pool Id for managing users"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "/videoStreamer/dev/users/pool_id"
      + tags_all    = (known after apply)
      + tier        = "Standard"
      + type        = "String"
      + value       = (sensitive value)
      + version     = (known after apply)
    }

Plan: 20 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Rihoj, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*